In [38]:
# Importar librerias

In [39]:
import pandas as pd
from sqlalchemy import create_engine
import os
from dotenv import load_dotenv

In [40]:
# Cargar variables de entorno
load_dotenv()
db_url = os.getenv("DATABASE_URL")

In [55]:
# Conexión de la base de datos
engine = create_engine(db_url)

### Tablas disponibles

In [45]:
query = """
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
"""
tablas = pd.read_sql(query, con=engine)

print("Tablas en la base de datos")
display(tablas)

Tablas en la base de datos

    table_name
0       tiempo
1       ventas
2       envios
3     clientes
4    productos
5  proveedores

### Características de las tablas

In [46]:
for table in tablas["table_name"]:
    print(f"\nEstructura de la tabla {table}")
    query = f"""
    SELECT column_name, data_type, character_maximum_length
    FROM information_schema.columns
    WHERE table_name = '{table}'
    """
    estructura = pd.read_sql(query, con=engine)
    display(estructura)

Estructura de la tabla tiempo

  column_name data_type character_maximum_length
0         día    bigint                     None
1        anio    bigint                     None
2         mes    bigint                     None
3  día_nombre      text                     None
4   tiempo_id      text                     None
5  mes_nombre      text                     None
6       fecha      text                     None
7        hora      text                     None

Estructura de la tabla ventas

       column_name         data_type character_maximum_length
0         cantidad            bigint                     None
1      sucursal_id            bigint                     None
2            total  double precision                     None
3  precio_unitario  double precision                     None
4        tiempo_id              text                     None
5      producto_id              text                     None
6       cliente_id              text                     None
7         venta_id              text                     None

Estructura de la tabla envios

    column_name data_type character_maximum_length
0      envio_id      text                     None
1      venta_id      text                     None
2  proveedor_id      text                     None
3  estado_envio      text                     None
4     tiempo_id      text                     None

Estructura de la tabla clientes

  column_name data_type character_maximum_length
0        edad    bigint                     None
1  cliente_id      text                     None
2      nombre      text                     None
3      genero      text                     None
4   ubicacion      text                     None

Estructura de la tabla productos

       column_name         data_type character_maximum_length
0      precio_base  double precision                     None
1      producto_id              text                     None
2  nombre_producto              text                     None
3        categoria              text                     None

Estructura de la tabla proveedores

        column_name data_type character_maximum_length
0      proveedor_id      text                     None
1  nombre_proveedor      text                     None
2          contacto      text                     None
3         ubicacion      text                     None

### Conteo de los registros de cada tabla

In [47]:
print("Conteo de Filas por Tabla:")
for table in tablas["table_name"]:
    query = f"SELECT COUNT(*) FROM {table}"
    count = pd.read_sql(query, con=engine)
    print(f"{table.capitalize()} -> Total de filas: {count.iloc[0, 0]}")

Conteo de Filas por Tabla:
Tiempo -> Total de filas: 484807
Ventas -> Total de filas: 474086
Envios -> Total de filas: 17856
Clientes -> Total de filas: 49000
Productos -> Total de filas: 980
Proveedores -> Total de filas: 196

In [48]:
# Vista previa de los registros en cada tabla

In [49]:
for table in tablas["table_name"]:
    df = pd.read_sql(f"SELECT * FROM {table} LIMIT 5", con=engine)
    print(f"\n{table.capitalize()} - Primeras 5 filas:")
    display(df)

Tiempo - Primeras 5 filas:

    tiempo_id       fecha      hora  anio  mes  día día_nombre mes_nombre
0  0000000001  2023-01-01  00:00:00  2023    1    1     Sunday    January
1  0000000002  2023-01-01  00:01:00  2023    1    1     Sunday    January
2  0000000003  2023-01-01  00:03:00  2023    1    1     Sunday    January
3  0000000004  2023-01-01  00:04:00  2023    1    1     Sunday    January
4  0000000005  2023-01-01  00:05:00  2023    1    1     Sunday    January

Ventas - Primeras 5 filas:

,venta_id,producto_id,cantidad,precio_unitario,cliente_id,sucursal_id,total,tiempo_id
0,0000000001,0000000811,4,468.44,0000026032,69,1873.78,0000000001
1,0000000002,0000000538,16,241.69,0000006648,77,3866.97,0000000002
2,0000000004,0000000462,5,367.03,0000022158,69,1835.14,0000000003
3,0000000005,0000000043,14,28.97,0000025245,45,405.60,0000000004
4,0000000006,0000000712,11,345.73,0000024757,91,3803.04,0000000005

Envios - Primeras 5 filas:

     envio_id    venta_id proveedor_id estado_envio   tiempo_id
0  0000000001  0000306210   0000000010    Retrasado  0000001409
1  0000000002  0000159044   0000000076    Entregado  0000001468
2  0000000003  0000230549   0000000137  En tránsito  0000001525
3  0000000004  0000133984   0000000164    Retrasado  0000001583
4  0000000005  0000262497   0000000051    Retrasado  0000001641

Clientes - Primeras 5 filas:

   cliente_id     nombre  edad     genero  ubicacion
0  0000000001  Cliente_1    54       Otro     Puebla
1  0000000002  Cliente_2    46  Masculino    Tijuana
2  0000000003  Cliente_3    68   Femenino  Monterrey
3  0000000004  Cliente_4    21  Masculino       Cdmx
4  0000000005  Cliente_5    54       Otro       Cdmx

Productos - Primeras 5 filas:

  producto_id nombre_producto  categoria  precio_base
0  0000000001      Producto_1       Ropa       172.87
1  0000000002      Producto_2       Ropa       392.52
2  0000000003      Producto_3       Ropa        94.29
3  0000000004      Producto_4  Abarrotes       370.64
4  0000000005      Producto_5  Abarrotes        51.53

Proveedores - Primeras 5 filas:

  proveedor_id nombre_proveedor               contacto  ubicacion
0   0000000001      Proveedor_1  contacto1@empresa.com  Monterrey
1   0000000002      Proveedor_2  contacto2@empresa.com    Tijuana
2   0000000003      Proveedor_3  contacto3@empresa.com    Tijuana
3   0000000004      Proveedor_4  contacto4@empresa.com       Cdmx
4   0000000005      Proveedor_5  contacto5@empresa.com  Monterrey

### Revisión de valores nulos

In [50]:
print("Nulos por Tabla:")
for table in tablas["table_name"]:
    df = pd.read_sql(f"SELECT * FROM {table}", con=engine)
    print(f"\n{table.capitalize()} - Valores Nulos:")
    nulls = df.isnull().sum()
    if nulls.sum() > 0:
        print(nulls[nulls > 0])
    else:
        print("No hay valores nulos")
    print("-" * 40)

Nulos por Tabla:

Tiempo - Valores Nulos:
No hay valores nulos
----------------------------------------

Ventas - Valores Nulos:
No hay valores nulos
----------------------------------------

Envios - Valores Nulos:
No hay valores nulos
----------------------------------------

Clientes - Valores Nulos:
No hay valores nulos
----------------------------------------

Productos - Valores Nulos:
No hay valores nulos
----------------------------------------

Proveedores - Valores Nulos:
No hay valores nulos
----------------------------------------

### Revisión de registros duplicados

In [51]:
print("\nRegistros Duplicados por Tabla:")
for table in tablas["table_name"]:
    df = pd.read_sql(f"SELECT * FROM {table}", con=engine)
    duplicates = df.duplicated().sum()
    print(f"{table.capitalize()} - Duplicados: {duplicates}")
    print("-" * 40)

Registros Duplicados por Tabla:
Tiempo - Duplicados: 0
----------------------------------------
Ventas - Duplicados: 0
----------------------------------------
Envios - Duplicados: 0
----------------------------------------
Clientes - Duplicados: 0
----------------------------------------
Productos - Duplicados: 0
----------------------------------------
Proveedores - Duplicados: 0
----------------------------------------

### Revisión de relaciones entre tablas

In [52]:
def check_foreign_keys(foreign_key_checks):
    print("\nVerificación de Claves Foráneas:")
    for description, query in foreign_key_checks:
        df = pd.read_sql(query, con=engine)
        print(f"{description} - Registros encontrados: {len(df)}")
        if not df.empty:
            display(df)
        else:
            print("No se encontraron registros relevantes.")
        print("-" * 40)

In [53]:
foreign_key_checks = [
    ("Ventas sin fecha en 'tiempo'", """
        SELECT v.venta_id FROM ventas v
        LEFT JOIN tiempo t ON v.tiempo_id = t.tiempo_id
        WHERE t.tiempo_id IS NULL
    """),
    ("Ventas con productos inexistentes en 'productos'", """
        SELECT v.venta_id, v.producto_id FROM ventas v
        LEFT JOIN productos p ON v.producto_id = p.producto_id
        WHERE p.producto_id IS NULL
    """),
    ("Ventas con clientes inexistentes en 'clientes'", """
        SELECT v.venta_id, v.cliente_id FROM ventas v
        LEFT JOIN clientes c ON v.cliente_id = c.cliente_id
        WHERE c.cliente_id IS NULL
    """),
    ("Envíos con ventas inexistentes en 'ventas'", """
        SELECT e.envio_id, e.venta_id FROM envios e
        LEFT JOIN ventas v ON e.venta_id = v.venta_id
        WHERE v.venta_id IS NULL
    """),
    ("Envíos sin fecha en 'tiempo'", """
        SELECT e.envio_id, e.tiempo_id FROM envios e
        LEFT JOIN tiempo t ON e.tiempo_id = t.tiempo_id
        WHERE t.tiempo_id IS NULL
    """),
    ("Envíos con proveedores inexistentes en 'proveedores'", """
        SELECT e.envio_id, e.proveedor_id FROM envios e
        LEFT JOIN proveedores p ON e.proveedor_id = p.proveedor_id
        WHERE p.proveedor_id IS NULL
    """)
]

In [54]:
check_foreign_keys(foreign_key_checks)

Verificación de Claves Foráneas:
Ventas sin fecha en 'tiempo' - Registros encontrados: 0
No se encontraron registros relevantes.
----------------------------------------
Ventas con productos inexistentes en 'productos' - Registros encontrados: 0
No se encontraron registros relevantes.
----------------------------------------
Ventas con clientes inexistentes en 'clientes' - Registros encontrados: 0
No se encontraron registros relevantes.
----------------------------------------
Envíos con ventas inexistentes en 'ventas' - Registros encontrados: 0
No se encontraron registros relevantes.
----------------------------------------
Envíos sin fecha en 'tiempo' - Registros encontrados: 0
No se encontraron registros relevantes.
----------------------------------------
Envíos con proveedores inexistentes en 'proveedores' - Registros encontrados: 0
No se encontraron registros relevantes.
----------------------------------------